<section class="default-section sec-padd">
    <div class="container">
        <div class="row">
            <div class="col-md-7 col-sm-12 col-xs-12">
                <div class="text-content">
                    {!! $data !!}
                    {{-- <h2 class="about_me_title">ডাঃ একেএম জিয়াউল হক</h2>
                    <div class="text">
                        <p class="about_me_text">
                            <b>ডাঃ একেএম জিয়াউল হক</b>, রক্তনালীর রোগ বিশেষজ্ঞ এবং সার্জন (Vascular and
                            Endovascular
                            Surgeon)। তিনি রাজশাহী মেডিকেল কলেজ থেকে ২০০৪ সালে এমবিবিএস পাশ করেছেন। এরপর তিনি এক
                            বছর গণস্বাস্থ্য সমাজভিত্তিক মেডিকেল কলেজ এ ফিজিওলজি বিভাগে প্রভাষক হিসেবে কাজ
                            করেছেন। পরবর্তীতে তিনি ২০০৬ সালে ২৫তম বিসিএস এর মাধ্যমে সরকারী চাকুরীতে যোগদান করেন।
                            ২০১৬ সালের জানুয়ারীতে তিনি বঙ্গবন্ধু শেখ মুজিব মেডিকেল বিশ্ববিদ্যালয় (বিএসএমএমইউ)
                            হতে কার্ডিও-ভাসকুলার সার্জারীতে উচ্চতর ডিগ্রী মাস্টার অব সার্জারী (এমএস) ডিগ্রী
                            অর্জন করেছেন। চিকিৎসা সংক্রান্ত বিষয়ে উন্নত প্রশিক্ষনের জন্য ভারত, সিঙ্গাপুর এবং
                            তুরস্ক গমন করেছেন। বর্তমানে তিনি জাতীয় হৃদরোগ হাসপাতালের ভাসকুলার সার্জারী বিভাগে
                            এবং ভাসকুলার কেয়ার সেন্টার, ইবনে সিনা হাসপাতাল এ কনসালটেন্ট, ভাসকুলার এবং
                            এন্ডোভাসকুলার সার্জন হিসেবে কর্মরত আছেন।
                        </p>
                    </div> --}}
                </div>
            </div>
            <div class="col-md-5 col-sm-12 col-xs-12">
                <figure class="img-box">
                    <a href="#"><img src="/{{ $image }}" alt=""></a>
                </figure>
            </div>
        </div>
    </div>
</section>
